# Exercise 2
Add the specified code for each code cell, running the cells _in order_.

Run the below cell to import `pandas` and `numpy`

In [1]:
import pandas as pd
import numpy as np

Create a Series of 100 employees **`names`** ("Employee 1", "Employee 2", ... "Employee 100"). _Tip:_ use a list comprehension to produce the list of strings by concatenating "Employee" with the numbers from a range.
- Use the `head()` and `tail()` methods to print the first and last 3 employees to check your work.

In [8]:
employee_list = ['Employee'+ str(number) for number in range(1, 101)]
names = pd.Series(employee_list)
print(names.head())
print(names.tail(3))

0    Employee1
1    Employee2
2    Employee3
3    Employee4
4    Employee5
dtype: object
97     Employee98
98     Employee99
99    Employee100
dtype: object

Create a Series of 100 random salaries for the year 2016. These should be uniformly distributed between 40000 and 50000. _Hint:_ try using the [**numpy.random.uniform()**](https://docs.scipy.org/doc/numpy/reference/generated/numpy.random.uniform.html) function, or call the Python `random.uniform()` function repeatedly.
- This is not a liveable wage in Seattle, and in fact is below US median :(

In [12]:
salaries_2016 = pd.Series(np.random.uniform(40000, 50000, 100))
salaries_2016.head()

0    42582.659535
1    45775.797174
2    41485.645726
3    48821.199664
4    46072.623863
dtype: float64

Create a Series of 100 salaries in 2017 that have changed from 2016 by a random amount between -5000 and 10000.

In [15]:
salaries_2017 = salaries_2016 + np.random.uniform(-5000, 10000, 100)
salaries_2017.head()

0    46216.433346
1    51730.679354
2    48168.796094
3    45237.196268
4    45751.342872
dtype: float64

Create a DataFrame **`salaries`** by combining the three Series you just made (employee names, 2016 salaries, and 2017 salaries).

In [19]:
salaries = pd.DataFrame({
    'name':names,
    'salary_2016': salaries_2016,
    'salary_2017': salaries_2017
})

        name   salary_2016   salary_2017
0  Employee1  42582.659535  46216.433346
1  Employee2  45775.797174  51730.679354
2  Employee3  41485.645726  48168.796094
3  Employee4  48821.199664  45237.196268
4  Employee5  46072.623863  45751.342872

Print the first 10 rows in the `salaries` DataFrame.

In [20]:
salaries.head(10)

         name   salary_2016   salary_2017
0   Employee1  42582.659535  46216.433346
1   Employee2  45775.797174  51730.679354
2   Employee3  41485.645726  48168.796094
3   Employee4  48821.199664  45237.196268
4   Employee5  46072.623863  45751.342872
5   Employee6  49255.714931  49022.215755
6   Employee7  41853.545271  37689.099530
7   Employee8  45303.441461  48755.239694
8   Employee9  48791.543049  49049.593268
9  Employee10  46779.763010  46815.696525

Add a column **`change`** to your DataFrame that contains the difference in salary between 2017 and 2016.

In [22]:
salaries['change'] = salaries['salary_2017'] - salaries['salary_2016']
salaries.head(10)

         name   salary_2016   salary_2017       change
0   Employee1  42582.659535  46216.433346  3633.773811
1   Employee2  45775.797174  51730.679354  5954.882180
2   Employee3  41485.645726  48168.796094  6683.150368
3   Employee4  48821.199664  45237.196268 -3584.003396
4   Employee5  46072.623863  45751.342872  -321.280991
5   Employee6  49255.714931  49022.215755  -233.499176
6   Employee7  41853.545271  37689.099530 -4164.445741
7   Employee8  45303.441461  48755.239694  3451.798233
8   Employee9  48791.543049  49049.593268   258.050220
9  Employee10  46779.763010  46815.696525    35.933516

Add a column **`got_raise`** to your DataFrame that is `True` if the employee got a raise (their salary increased) in 2017.

In [27]:
salaries['got_raise'] = salaries.change > 0 
salaries.head()

        name   salary_2016   salary_2017       change  got_raise
0  Employee1  42582.659535  46216.433346  3633.773811       True
1  Employee2  45775.797174  51730.679354  5954.882180       True
2  Employee3  41485.645726  48168.796094  6683.150368       True
3  Employee4  48821.199664  45237.196268 -3584.003396      False
4  Employee5  46072.623863  45751.342872  -321.280991      False

**Retrieve values from the `salaries` DataFrame to answer the following questions. Try to get as specific a value as possible (e.g., a single value rather than the whole row!)**

What was the 2017 salary of Employee 57?

In [28]:
salaries.iloc[56]

name           Employee57
salary_2016       46696.9
salary_2017       50306.1
change            3609.23
got_raise            True
Name: 56, dtype: object

How many employees got a raise? (It should be around 2/3rds)

In [29]:
salaries[salaries.got_raise == True].count()

name           71
salary_2016    71
salary_2017    71
change         71
got_raise      71
dtype: int64

In [31]:
sum(salaries.got_raise)

71

What was the amount of the largest raise?

What was the "name" of the employee who received the highest raise?

What is the name and 2017 salary of the person who received the largest payment (decrease in salary) between the two years?